Revit 2024 API
Pipe.PipeType Property
 The pipe type of this pipe.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public PipeType PipeType { get; set; }
Visual Basic
Public Property PipeType As PipeType
	Get
	Set
Visual C++
public:
property PipeType^ PipeType {
	PipeType^ get ();
	void set (PipeType^ value);
}
See Also
Pipe Class
Autodesk.Revit.DB.Plumbing Namespace